Repository: theskyblockman/life-chest
Catalog: lib/l10n/intl_*.arb
Languages: fr

# welcomePage1Title
source: Hello there!
fr: Bienvenue !

# welcomePage1Content
source: Welcome to your Life Chest! Here, you will be able to create chests to store your data securely without compromising usability.
fr: Bienvenue dans votre coffre-fort Life Chest ! Ici, vous pourrez créer des coffres pour stocker vos données en toute sécurité sans compromettre la convivialité.

# welcomePage2Title
source: Your Security is Our Main Priority
fr: Votre sécurité est notre priorité

# welcomePage2Content
source: We use an encryption system called Chacha20, which means attempting to access your files without your password would take about 200 trillions of trillions of trillions times the age of the universe! And to prove it, we are 100% open-source!
fr: Nous utilisons un système de chiffrement appelé Chacha20, ce qui signifie que toute tentative d'accès à vos fichiers sans votre mot de passe prendrait environ 200 trillions de trillions de trillions de fois l'âge de l'univers ! Et pour le prouver, nous sommes 100 % open-source !

# welcomePage3Title
source: Let's Create Your First Chest!
fr: Créons votre premier coffre !

# welcomePage3Content
source: You'll see, it's fast, easy, and secure!
fr: Vous verrez, c'est rapide, facile et sécurisé !

# welcomeSkip
source: Skip
fr: Passer

# welcomeNext
source: Next
fr: Suivant

source: Create a New Chest
fr: Créer un nouveau coffre

source: Chest Name
fr: Nom du coffre

# errorChestNameShouldNotBeEmpty
source: The chest name must not be empty
fr: Le nom du coffre ne peut pas être vide

source: Chest Password
fr: Mot de passe du coffre

# errorChestPasswordShouldNotBeEmpty
source: The password must not be empty
fr: Le mot de passe ne peut pas être vide

# errorChestPasswordMoreCharacters
source: The password must be at least 8 characters long
fr: Le mot de passe doit contenir au moins 8 caractères

# errorChestPinCodeMoreCharacters
source: The chest PIN code should be at least 4 digits long
fr: Le code PIN doit contenir au moins 4 caractères

# errorChestPasswordMoreUppercaseLetter
source: The password must contain at least one uppercase character
fr: Le mot de passe doit contenir au moins une lettre majuscule

# errorChestPasswordMoreLowercaseLetter
source: The password must contain at least one lowercase character
fr: Le mot de passe doit contenir au moins une lettre minuscule

# errorChestPasswordMoreDigits
source: The password must contain at least one digit
fr: Le mot de passe doit contenir au moins un chiffre

# errorChestSchemeShouldNotBeEmpty
source: The scheme must not be empty
fr: Le modèle ne peut pas être vide

# whatShouldBeDoneAfterUnfocus
source: What should we do when the application is paused
fr: Que devons-nous faire lorsque l'application est en pause

source: Do nothing
fr: Ne rien faire

# notify
source: Notify you
fr: Vous notifier

# closeChest
source: Close the chest
fr: Fermer le coffre

# errorDurationMustNotBeEmpty
source: The duration must not be empty
fr: La durée ne peut pas être vide

# errorDurationMustBeFormatted
source: The duration must be in the HH:MM format
fr: La durée doit être au format HH:MM

# createTheNewChest
source: Create the Chest
fr: Créer le coffre

# appLegalese
source: The application "Life Chest" has been made by Theskyblockman with ❤️ and a 🖥️ under the MIT license. We do not provide any warranty, see the MIT license for more information ©️ 2023 Haroun El Omri
fr: L'application "Life Chest" a été créée par Theskyblockman avec ❤️ et un 🖥️ sous la licence MIT. Nous ne donnons aucune garantie, veuillez consulter la licence MIT pour plus d'informations ©️ 2023 Haroun El Omri

source: No chests created yet
fr: Aucun coffre créé pour le moment

# noFilesCreatedYet
source: No files added yet
fr: Aucun fichier ajouté pour le moment

# enterTheChestPassword
source: Please enter the password of this chest
fr: Veuillez entrer le mot de passe de ce coffre

source: Validate
fr: Valider

source: Delete
fr: Supprimer

# deleteAllChests
source: Delete all the chests
fr: Supprimer tous les coffres

source: Rename
fr: Renommer

source: About...
fr: À propos...

source: Add files
fr: Ajouter des fichiers

source: Loading elements
fr: Chargement des éléments

# loadingDocuments
source: Loading document
fr: Chargement des documents

source: Loading image
fr: Chargement de l'image

source: Loading audio track
fr: Chargement de la piste audio

source: Loading video
fr: Chargement de la vidéo

# pickFilesDialogTitle
source: Pick the files you want to add
fr: Sélectionnez les fichiers que vous souhaitez ajouter

# pickFolderDialogTitle
source: Pick the folder you want to add
fr: Sélectionnez le dossier que vous souhaitez ajouter

# selected
source: {count} selected
fr: {count} {count, plural, =1{fichier sélectionné} other{fichiers sélectionnés}}

source: Select all
fr: Tout sélectionner

source: Wrong password
fr: Mot de passe incorrect

source: Cancel
fr: Annuler

# areYouSureClearVaults
source: Are you sure you want to delete all vaults?
fr: Êtes-vous sûr de vouloir supprimer tous les coffres ?

# areYouSureDeleteVault
source: Are you sure you want to delete "{vaultName}"?
fr: Êtes-vous sûr de vouloir supprimer "{vaultName}" ?

# areYouSureDeleteFiles
source: Are you sure you want to delete {count} {count, plural, =1{file} other{files}}?
fr: Êtes-vous sûr de vouloir supprimer {count} {count, plural, =1{fichier} other{fichiers}}?

# lostDataContBeRecovered
source: This action is irreversible! All lost data can't be recovered.
fr: Cette action est irréversible ! Toutes les données perdues ne pourront pas être récupérées.

source: Yes
fr: Oui

source: No
fr: Non

# closeChestNotificationTitle
source: You still have a chest opened
fr: Vous avez encore un coffre ouvert

# closeChestNotificationContent
source: Click on the button down there to close it
fr: Cliquez sur le bouton ci-dessous pour le fermer

source: Create a new folder
fr: Créer un nouveau dossier

source: New folder
fr: Nouveau dossier

source: Sort by...
fr: Trier par...

# numberSortName
source: First detected number
fr: Premier nombre détecté

# nameSortName
source: Alphabetical order
fr: Ordre alphabétique

source: Password
fr: Mot de passe

source: PIN code
fr: Code PIN

# scheme
source: Pattern
fr: Schéma

source: Chest PIN code
fr: Code PIN du coffre

# enterTheChestScheme
source: Please enter the unlocking pattern of this chest
fr: Veuillez entrer le modèle de déverrouillage de ce coffre

# enterThePinCode
source: Please enter the pin code of this chest
fr: Veuillez entrer le code PIN de ce coffre

source: Wrong PIN code
fr: Code PIN incorrect

# unlockChest
source: Unlock the chest
fr: Déverrouiller le coffre

# pleaseUseBiometrics
source: Please use your biometrics to unlock the chest
fr: Veuillez utiliser votre empreinte digitale pour déverrouiller le coffre

# defineScheme
source: Define the scheme
fr: Définir le modèle de déverrouillage

# errorChestPinCodeShouldNotBeEmpty
source: The chest PIN code shouldn't be empty
fr: Le code PIN ne peut pas être vide

source: Biometrics
fr: Empreinte digitale

# detectedExportedFile
source: We detected {count, plural, =1{a file} other{multiple files}} that come from a vault. To access {count, plural, =1{its} other{their}} content, you must unlock them.
fr: Nous avons détecté {count, plural, =1{un fichier} other{des fichiers}} provenant d'un coffre. Pour accéder à {count, plural, =1{son} other{leur}} contenu, vous devez {count, plural, =1{le} other{les}} déverrouiller.

# unlockFile
source: Unlock the file
fr: Déverrouiller le fichier

# useUnlockWizard
source: Use the unlock wizard
fr: Utiliser l'assistant de déverrouillage

source: Unlock wizard
fr: Assistant de déverrouillage

source: Ignore
fr: Ignorer

# exportAsCleartext
source: Export as a clear file (not encrypted)
fr: Exporter en tant que fichier lisible (non chiffré)

# exportAsEncrypted
source: Export as an encrypted file
fr: Exporter en tant que fichier chiffré

# lifeChestBulkSave
source: Life Chest bulk file export
fr: Exportation en masse de fichiers Life Chest

# savedToFolder
source: We successfully saved the file(s)
fr: Nous avons enregistré avec succès le(s) fichier(s).

# savedToFolderWarning
source: We successfully saved the file(s). WARNING! These encrypted files are more vulnerable in this format, do not publicly distribute them. Life Chest, its authors, or its contributors cannot be held liable for any divulged data.
fr: Nous avons enregistré avec succès le(s) fichier(s). ATTENTION! Ces fichiers chiffrés sont plus vulnérables dans ce format, ne les distribuez pas publiquement. Life Chest, ses auteurs ou ses contributeurs ne peuvent être tenus responsables des données divulguées.

source: Import
fr: Importer

# group
source: Group n.{groupID}
fr: Groupe n°{groupID}

# unlockAbleBy
source: This group can be unlocked with: {unlockName}.
fr: Déverouillable grâce à : {unlockName}.

# exportedFileDescription
source: A file exported from the Life Chest app and needs to be unlocked to get more information about it.
fr: Un fichier exporté depuis l'application Life Chest et qui nécessite d'être déverrouillé pour accéder à ses informations.

source: Internal Error
fr: Erreur interne

# wrongDevice
source: Wrong device, couldn't find the unlock data in the keystore
fr: Mauvais appareil, impossible de trouver les données de déverrouillage dans le téléphone.

# biometricsAreLocal
source: Biometrics-locked chests can only be unlocked on the device it has been created on. Encrypted file export is unavailable.
fr: Les coffres verrouillés par biométrie ne peuvent être déverrouillés que sur l'appareil sur lequel ils ont été créés. L'exportation de fichiers chiffrés n'est pas disponible.

# linkCopied
source: The link has been copied to your clipboard.
fr: Le lien a été copié dans votre presse-papiers.

source: Subtitles
fr: Sous-titres

source: Playback speed
fr: Vitesse de lecture
